In [116]:
import pandas as pd #For handling Database
import numpy as np #Powerful tool for handling multi dimensional arrays

In [117]:
df = pd.read_csv('house_data.csv') #Reads a comma-separated values (csv) file into a DataFrame.
# Here, 'train.csv' is loaded into a Dataframe named 'df'

In [118]:
#To read .csv file
df = pd.read_csv('house_data.csv') 

#To read .xlsx file
#df = pd.read_excel('house_data.xlsx')

#To read a dictionary
house_data = {
    'date': ['13/10/14','12/09/14','25/02/15','12/09/14','18/02/15','12/05/14','27/06/14','15/01/15','15/04/15','12/03/15'],
    'living_sqr_ft': [1180,2570,770,1960,1680,5420,1715,1060,1780,1890],
    'bedrooms': [3,3,2,4,3,4,3,3,3,3],
    'price': [221900,538000,180000,604000,510000,1230000,257500,291850,229500,323000]
}
df = pd.DataFrame(house_data)

In [119]:
df

       date  living_sqr_ft  bedrooms    price
0  13/10/14           1180         3   221900
1  12/09/14           2570         3   538000
2  25/02/15            770         2   180000
3  12/09/14           1960         4   604000
4  18/02/15           1680         3   510000
5  12/05/14           5420         4  1230000
6  27/06/14           1715         3   257500
7  15/01/15           1060         3   291850
8  15/04/15           1780         3   229500
9  12/03/15           1890         3   323000

In [120]:
#Returns no of rows and columns in dataframe
df.shape
#OR
rows, columns = df.shape

In [121]:
#Statistical info about Dataframe
df.describe()

       living_sqr_ft   bedrooms         price
count      10.000000  10.000000  1.000000e+01
mean     2002.500000   3.100000  4.385750e+05
std      1305.367658   0.567646  3.151545e+05
min       770.000000   2.000000  1.800000e+05
25%      1305.000000   3.000000  2.365000e+05
50%      1747.500000   3.000000  3.074250e+05
75%      1942.500000   3.000000  5.310000e+05
max      5420.000000   4.000000  1.230000e+06

In [122]:
#General info about Dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           10 non-null     object
 1   living_sqr_ft  10 non-null     int64
 2   bedrooms       10 non-null     int64
 3   price          10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes

In [123]:
df.head()#Display top 5 elements by defaults

#df.head(n) #Displays top n elements

       date  living_sqr_ft  bedrooms   price
0  13/10/14           1180         3  221900
1  12/09/14           2570         3  538000
2  25/02/15            770         2  180000
3  12/09/14           1960         4  604000
4  18/02/15           1680         3  510000

In [124]:
df.tail()#Display blast 5 elements by defaults

#df.tail(n) #Displays last n elements

       date  living_sqr_ft  bedrooms    price
5  12/05/14           5420         4  1230000
6  27/06/14           1715         3   257500
7  15/01/15           1060         3   291850
8  15/04/15           1780         3   229500
9  12/03/15           1890         3   323000

In [125]:
df #Prints entire dataset

       date  living_sqr_ft  bedrooms    price
0  13/10/14           1180         3   221900
1  12/09/14           2570         3   538000
2  25/02/15            770         2   180000
3  12/09/14           1960         4   604000
4  18/02/15           1680         3   510000
5  12/05/14           5420         4  1230000
6  27/06/14           1715         3   257500
7  15/01/15           1060         3   291850
8  15/04/15           1780         3   229500
9  12/03/15           1890         3   323000

In [126]:
df.columns #Returns list of column names

Index(['date', 'living_sqr_ft', 'bedrooms', 'price'], dtype='object')

In [127]:
df.date #Display the 'date' column
#OR
df['date']

0    13/10/14
1    12/09/14
2    25/02/15
3    12/09/14
4    18/02/15
5    12/05/14
6    27/06/14
7    15/01/15
8    15/04/15
9    12/03/15
Name: date, dtype: object

In [128]:
df[['living_sqr_ft','bedrooms','price']] #Display only the mentioned columns

   living_sqr_ft  bedrooms    price
0           1180         3   221900
1           2570         3   538000
2            770         2   180000
3           1960         4   604000
4           1680         3   510000
5           5420         4  1230000
6           1715         3   257500
7           1060         3   291850
8           1780         3   229500
9           1890         3   323000

In [129]:
df.price.max() # Returns max Temp

df.price.mean() #Return avg Temp

438575.0

In [130]:
df.fillna(0, inplace = True)  #replaces EVERY Nan in the dataframe by 0
df.price.mean()

438575.0

In [131]:
#Replaces Nan by 0 in Temperature column ONLY
df['price'].replace(to_replace = np.nan, value = 0, inplace = True)

In [132]:
df.price.isnull().sum() # Returns no of null values in temp column

0

In [133]:
df.price.sum() #Returns sum of all values in Temo column

4385750

In [134]:
df.living_sqr_ft.count() #Returns no of entries in Summary column

10

In [135]:
df.living_sqr_ft.unique() #Returns unique elements in living_sqr_ft column

array([1180, 2570,  770, 1960, 1680, 5420, 1715, 1060, 1780, 1890],
      dtype=int64)

In [136]:
df.living_sqr_ft.value_counts() #returns frequency of every unique element in Summary column

1780    1
1180    1
2570    1
1890    1
1960    1
1060    1
1715    1
770     1
5420    1
1680    1
Name: living_sqr_ft, dtype: int64

In [137]:
df[df.price == df.price.max()] #Gives entire entry with max price

       date  living_sqr_ft  bedrooms    price
5  12/05/14           5420         4  1230000

In [138]:
df['price'][df['living_sqr_ft'] >= 1000]  #Prints ONLY prices where living_sqr_ft is greater than or equal to 1000

0     221900
1     538000
3     604000
4     510000
5    1230000
6     257500
7     291850
8     229500
9     323000
Name: price, dtype: int64

In [139]:
df[['price', 'bedrooms']][df['living_sqr_ft'] >= 1000]  #Prints prices and no. of bedrooms where living_sqr_ft is greater than or equal to 1000

     price  bedrooms
0   221900         3
1   538000         3
3   604000         4
4   510000         3
5  1230000         4
6   257500         3
7   291850         3
8   229500         3
9   323000         3

In [140]:
df.set_index('living_sqr_ft', inplace=True) #Sets living_sqr_ft as index for Dataframe

In [141]:
df.loc[770] #finds a element with provided index

date        25/02/15
bedrooms           2
price         180000
Name: 770, dtype: object

In [142]:
df.reset_index(inplace=True) #resets the index for the dataframe
#NOTE:- While reseting index the current index of the dataframe gets deleted

In [143]:
df.set_index('price', inplace=True)

In [144]:
df.loc[510000]

living_sqr_ft        1680
date             18/02/15
bedrooms                3
Name: 510000, dtype: object

In [145]:
df.head()

        living_sqr_ft      date  bedrooms
price
221900           1180  13/10/14         3
538000           2570  12/09/14         3
180000            770  25/02/15         2
604000           1960  12/09/14         4
510000           1680  18/02/15         3

In [146]:
df.rename(columns = {'date':'date_of_sale'}, inplace = True)

In [147]:
df.head()

        living_sqr_ft date_of_sale  bedrooms
price
221900           1180     13/10/14         3
538000           2570     12/09/14         3
180000            770     25/02/15         2
604000           1960     12/09/14         4
510000           1680     18/02/15         3

In [148]:
dummies = pd.get_dummies(df.living_sqr_ft) #Create a new Dataframe 'dummies' with vectors representing 'living_sqr_ft' column

In [149]:
df = pd.concat([df,dummies],axis='columns')  #Merges two dataframe i.e. dummies and df

In [150]:
df = df.drop(['living_sqr_ft'], axis='columns')  #removes the unwanted living_sqr_ft coumn
df

,date_of_sale,bedrooms,770,1060,1180,1680,1715,1780,1890,1960,2570,5420
price,,,,,,,,,,,,
221900,13/10/14,3,0,0,1,0,0,0,0,0,0,0
538000,12/09/14,3,0,0,0,0,0,0,0,0,1,0
180000,25/02/15,2,1,0,0,0,0,0,0,0,0,0
604000,12/09/14,4,0,0,0,0,0,0,0,1,0,0
510000,18/02/15,3,0,0,0,1,0,0,0,0,0,0
1230000,12/05/14,4,0,0,0,0,0,0,0,0,0,1
257500,27/06/14,3,0,0,0,0,1,0,0,0,0,0
291850,15/01/15,3,0,1,0,0,0,0,0,0,0,0
229500,15/04/15,3,0,0,0,0,0,1,0,0,0,0
323000,12/03/15,3,0,0,0,0,0,0,1,0,0,0

In [151]:
df1 = df.copy()

In [152]:
train = df1.sample(frac=0.75, random_state=1)
test = df1.drop(train.index)

In [153]:
train

,date_of_sale,bedrooms,770,1060,1180,1680,1715,1780,1890,1960,2570,5420
price,,,,,,,,,,,,
180000,25/02/15,2,1,0,0,0,0,0,0,0,0,0
323000,12/03/15,3,0,0,0,0,0,0,1,0,0,0
257500,27/06/14,3,0,0,0,0,1,0,0,0,0,0
510000,18/02/15,3,0,0,0,1,0,0,0,0,0,0
221900,13/10/14,3,0,0,1,0,0,0,0,0,0,0
604000,12/09/14,4,0,0,0,0,0,0,0,1,0,0
538000,12/09/14,3,0,0,0,0,0,0,0,0,1,0
291850,15/01/15,3,0,1,0,0,0,0,0,0,0,0

In [154]:
test.count()

date_of_sale    2
bedrooms        2
770             2
1060            2
1180            2
1680            2
1715            2
1780            2
1890            2
1960            2
2570            2
5420            2
dtype: int64

In [155]:
from sklearn.model_selection import train_test_split

In [160]:
X=df.bedrooms
y=df.date_of_sale

In [161]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)
    
#To execute the above command you must import scikit-learn like -> from sklearn.model_selection import train_test_split
#Also create varibles 'X' and 'y'